tap "buo/cask-upgrade"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"
tap "anomalyco/tap"
tap "tw93/tap"

brew "bash"
brew "bash-completion"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "fzf"
brew "gh"
brew "go"
brew "gpg"
brew "helm"
brew "htop"
brew "jq"
brew "kubernetes-cli"
brew "lima"
brew "mas"
brew "mise"
brew "mole"
brew "neovim"
brew "node"
brew "opencode"
brew "ripgrep"
brew "starship"
brew "stow"
brew "yq"
brew "zoxide"
brew "jesseduffield/lazygit/lazygit"

cask "bambu-studio"
cask "calude-code"
cask "datagrip"
cask "ungoogled-chromium"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "legcord"
cask "libreoffice"
cask "spotify"
cask "zed"
cask "yaak"

mas "AdGuard for Safari", id: 1440147259
mas "Bitwarden", id: 1352778147
mas "Refined GitHub", id: 1519867270

if File.exist?(File.expand_path("~/.work"))
    brew "openfortivpn"
    brew "libpq", link: true
    mas "Slack", id: 803453959
end

if File.exist?(File.expand_path("~/.personal"))
    tap "LizardByte/homebrew"
    brew "sunshine"
    mas "Photomator", id: 1444636541
end

