tap "homebrew/bundle"
tap "buo/cask-upgrade"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"

brew "bash"
brew "bash-completion"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "fzf"
brew "gh"
brew "go"
brew "htop"
brew "hurl"
brew "jq"
brew "kubernetes-cli"
brew "libpq", link: true unless system "test", "-f ~/.work"
brew "lima"
brew "mas"
brew "neovim"
brew "node"
brew "ripgrep"
brew "rustup"
brew "starship"
brew "stow"
brew "yq"
brew "zoxide"
brew "volta"
brew "jesseduffield/lazygit/lazygit"

cask "datagrip" unless system "test", "-f ~/.work"
cask "firefox@beta"
cask "ghostty"
cask "legcord"
cask "postman" unless system "test", "-f ~/.work"
cask "rectangle"
cask "sdm" unless system "test", "-f ~/.work"
cask "spotify"
cask "zed"

mas "AdGuard for Safari", id: 1440147259
mas "Bitwarden", id: 1352778147
mas "Slack", id: 803453959 unless system "test", "-f ~/.work"
mas "Photomator", id: 1444636541 unless system "test", "-f ~/.personal"
